Tekla Open API Reference for Tekla Structures 2025
CannotPerformOperationDrawingMustBeActiveException Class
 The CannotPerformOperationDrawingMustBeActiveException class defines the exception that is thrown when a user tries to do an operation which requires that the drawing is active.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotPerformOperationDrawingMustBeActiveException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotPerformOperationDrawingMustBeActiveException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotPerformOperationDrawingMustBeActiveException
	Inherits TeklaStructuresDrawingsApplicationException
The CannotPerformOperationDrawingMustBeActiveException type exposes the following members.
Constructors
Name | Description
CannotPerformOperationDrawingMustBeActiveException
 Creates a new cannot perform operation drawing must be active exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace